export const getAnomalyText = (cts: 1 | 2) => {
  const anomalies = {
    1: [
      'Процессор T-16-G не выдержал вмешательства в жизненный цикл ЧВП1 и взорвался...',
      'Процессор T-16-G не смог отнести межвременной объект к какой-либо из ЧВП, в результате чего перегрелся и сжег временную систему...',
      'Из-за пояления межвременного объекта образовалась временная воронка, которая уничтожила T-16-G...'
    ],
    2: [
      'Процессор T-16-G не выдержал вмешательства в жизненный цикл ЧВП2 и взорвался...',
      'Процессор T-16-G не смог отнести межвременной объект к какой-либо из ЧВП, в результате чего перегрелся и сжег временную систему...',
      'Из-за пояления межвременного объекта образовалась временная воронка, которая уничтожила T-16-G...'
    ]
  }
  return anomalies[cts][Math.floor(Math.random() * 2.99)]
}